**`commonimages/components`** terraform plan on `pull_request` event [#75](${url})

```
data.aws_secretsmanager_secret.environment_management: Reading...
data.aws_secretsmanager_secret.environment_management: Read complete after 1s [id=<REDACTED>]
data.aws_secretsmanager_secret_version.environment_management: Reading...
data.aws_secretsmanager_secret_version.environment_management: Read complete after 0s [id=<REDACTED>]
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=<REDACTED>]
data.aws_kms_key.hmpps_ebs_encryption_cmk: Reading...
data.aws_kms_key.hmpps_ebs_encryption_cmk: Read complete after 0s [id=<REDACTED>]
aws_imagebuilder_component.this["yum_packages.yml"]: Refreshing state... [id=<REDACTED>]
aws_imagebuilder_component.this["ansible.yml"]: Refreshing state... [id=<REDACTED>]
aws_imagebuilder_component.this["python_3_9.yml"]: Refreshing state... [id=<REDACTED>]
aws_imagebuilder_component.this["python_3_6.yml"]: Refreshing state... [id=<REDACTED>]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_imagebuilder_component.this["powershell_core.yml"] will be created
  + resource "aws_imagebuilder_component" "this" {
      + arn          = (known after apply)
      + data         = <<-EOT
            ---
            name: powershell_core
            description: Component to upgrade to using PowerShell Core
            schemaVersion: 1.0
            parameters:
              - Version:
                  type: string
                  default: 0.1.6
                  description: Component version (update this each time the file changes)
              - Platform:
                  type: string
                  default: "Windows"
                  description: Platform.
              - PowerShellCoreVersion:
                  type: string
                  default: 7.3.1
                  description: Version of the PowerShell Core to install
            phases:
              - name: build
                steps:
                  - name: InstallPowerShellCore
                    action: ExecutePowerShell
                    inputs:
                      commands:
                        - |
                          choco install -y chocolatey-core.extension
                          choco install -y kb3118401
                          choco install -y powershell-core --version '{{ PowerShellCoreVersion }}' --install-arguments='"ADD_EXPLORER_CONTEXT_MENU_OPENPOWERSHELL=1 REGISTER_MANIFEST=1 ADD_FILE_CONTEXT_MENU_RUNPOWERSHELL=1 ENABLE_PSREMOTING=1"'
        EOT
      + date_created = (known after apply)
      + description  = "Component to upgrade to using PowerShell Core"
      + encrypted    = (known after apply)
      + id           = (known after apply)
      + kms_key_id   = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
      + name         = "powershell_core"
      + owner        = (known after apply)
      + platform     = "Windows"
      + tags         = {
          + "application"   = "n/a"
          + "branch"        = "main"
          + "business-unit" = "HMPPS"
          + "is-production" = "true"
          + "owner"         = "digital-studio-operations-team@digital.justice.gov.uk"
          + "source-code"   = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/components"
        }
      + tags_all     = {
          + "application"   = "n/a"
          + "branch"        = "main"
          + "business-unit" = "HMPPS"
          + "is-production" = "true"
          + "owner"         = "digital-studio-operations-team@digital.justice.gov.uk"
          + "source-code"   = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/components"
        }
      + type         = (known after apply)
      + version      = "0.1.6"
    }

  # aws_imagebuilder_component.this["prometheus_windows_exporter.yml"] will be created
  + resource "aws_imagebuilder_component" "this" {
      + arn          = (known after apply)
      + data         = <<-EOT
            ---
            name: prometheus_windows_exporter
            description: Component to install prometheus windows exporter.
            schemaVersion: 1.0
            parameters:
              - Version:
                  type: string
                  default: 1.1.4
                  description: Component version (update this each time the file changes)
              - Platform:
                  type: string
                  default: "Windows"
                  description: Platform.
              - WindowsExporterVersion:
                  type: string
                  default: 0.19.0
                  description: Version of the prometheus-windows-exporter
            phases:
              - name: build
                steps:
                  - name: InstallWMIExporter
                    action: ExecutePowerShell
                    inputs:
                      commands:
                        - choco install -y prometheus-windows-exporter.install --version '{{ WindowsExporterVersion }}' --params '"/ListenPort:9100"'
        EOT
      + date_created = (known after apply)
      + description  = "Component to install prometheus windows exporter."
      + encrypted    = (known after apply)
      + id           = (known after apply)
      + kms_key_id   = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
      + name         = "prometheus_windows_exporter"
      + owner        = (known after apply)
      + platform     = "Windows"
      + tags         = {
          + "application"   = "n/a"
          + "branch"        = "main"
          + "business-unit" = "HMPPS"
          + "is-production" = "true"
          + "owner"         = "digital-studio-operations-team@digital.justice.gov.uk"
          + "source-code"   = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/components"
        }
      + tags_all     = {
          + "application"   = "n/a"
          + "branch"        = "main"
          + "business-unit" = "HMPPS"
          + "is-production" = "true"
          + "owner"         = "digital-studio-operations-team@digital.justice.gov.uk"
          + "source-code"   = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/components"
        }
      + type         = (known after apply)
      + version      = "1.1.4"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "account_to_distribute_ami"
but a value was found in file "terraform.tfvars". If you meant to use this
value, add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

```
